/* GKErrorUserDenied description */
"The requested operation could not be completed because it was denied by the user." = "การทำงานที่ขอไม่สำเร็จเนื่องจากผู้ใช้ปฏิเสธ";

/* GKErrorNotAuthenticated description */
"The requested operation could not be completed because local player has not been authenticated." = "การทำงานที่ขอไม่สำเร็จเนื่องจากผู้เล่นภายในที่นี่ยังไม่ถูกยืนยัน";

/* GKErrorAuthenticationInProgress description */
"The requested operation could not be completed because local player is already authenticating." = "การทำงานที่ขอไม่สำเร็จเนื่องจากผู้เล่นภายในที่นี่ยังไม่ถูกยืนยัน";

/* GKErrorMatchRequestInvalid description */
"The requested operation could not be completed because the match request is invalid." = "การทำงานที่ขอไม่สำเร็จเนื่องจากการขอแข่งไม่ถูกต้อง";

/* GKErrorInvalidPlayer description */
"The requested operation could not be completed because the player is invalid." = "การทำงานที่ขอไม่สำเร็จเนื่องจากผู้เล่นไม่ถูกต้อง";

/* GKErrorPlayerStatusExceedsMaximumLength description */
"The requested operation could not be completed because the player status string exceeds the maximum length." = "การทำงานที่ขอไม่สำเร็จเนื่องจากสายอักขระสถานะของผู้เล่นเกินความยาวสูงสุด";

/* GKErrorPlayerStatusInvalid description */
"The requested operation could not be completed because the player status string is invalid." = "การทำงานที่ขอไม่สำเร็จเนื่องจากสายอักขระสถานะของผู้เล่นไม่ถูกต้อง";

/* GKErrorScoreNotSet description */
"The requested operation could not be completed because the score value has not been set." = "การทำงานที่ขอไม่สำเร็จเนื่องจากยังไม่ตั้งค่าแต้ม";

/* GKErrorInvalidCredentials description */
"The requested operation could not be completed because the username and/or password are incorrect." = "การทำงานที่ขอไม่สำเร็จเนื่องจากชื่อผู้ใช้หรือรวมทั้งรหัสผ่านไม่ถูกต้อง";

/* GKErrorGameUnrecognized description */
"The requested operation could not be completed because this application is not recognized by Game Center." = "การทำงานที่ขอไม่สำเร็จเนื่องจาก Game Center ไม่รู้จักแอพพลิเคชันนี้";

/* GKErrorParentalControlsBlocked description */
"The requested operation could not be completed because this feature has been disabled in Restrictions." = "การทำงานที่ขอไม่สำเร็จเนื่องจากคุณสมบัตินี้ถูกปิดใช้งานในการจำกัด";

/* GKErrorUnderage description */
"The requested operation could not be completed because this feature is disabled for underage players." = "การทำงานที่ขอไม่สำเร็จเนื่องจากคุณสมบัตินี้ถูกปิดใช้งานสำหรับผู้เล่นที่ยังไม่บรรลุนิติภาวะ";

/* GKErrorCommunicationsFailure description */
"The requested operation could not be completed due to an error communicating with the server." = "การทำงานที่ขอไม่สำเร็จเนื่องจากข้อผิดพลาดเกี่ยวกับการติดต่อเซิร์ฟเวอร์";

/* GKErrorUnknown description */
"The requested operation could not be completed due to an unknown error." = "การทำงานที่ขอไม่สำเร็จเนื่องจากข้อผิดพลาดที่ไม่รู้จัก";

/* GKErrorCancelled description */
"The requested operation has been cancelled." = "การทำงานที่ขอถูกยกเลิก";

